[
    {
        "_id":1,
        "images":[
            "/assets/img/projects/hackathon/1.jpg",
            "/assets/img/projects/hackathon/2.jpg",
            "/assets/img/projects/hackathon/3.jpg",
            "/assets/img/projects/hackathon/4.jpg",
            "/assets/img/projects/hackathon/5.jpg",
            "/assets/img/projects/hackathon/6.jpeg",
            "/assets/img/projects/hackathon/7.jpeg"
        ],
        "category":"past",
        "name":"Hackathon",
        "brief": "Hackathon, the competition was one of the country's largest ideathons launched by IESL Student Chapter of the University of Moratuwa in partnership with IESL and IESL-YMS at  Sri Lanka's largest technological exhibition -TECHNO.",
        "description": [
            "The IESL Student Chapter of University Moratuwa, as a renowned engineering student body within IESL, aspires to provide a recognized, academically subsidized and financially supported platform for the country's most dedicated engineering students through a variety of activities. Following up on the intended objective, the IESL Student Chapter of the University of Moratuwa, in partnership with IESL and IESL-YMS, was successful in launching one of the country's largest ideathons in collaboration with Sri Lanka's largest technological exhibition -TECHNO.",
            "All state engineering undergraduates were invited to participate in the competition, which was known as \"Hackathon\", where they were encouraged to illuminate their ideas, develop them into operating models, and finally present them to a distinguished and well-known judge panel in order to win grand monetary prizes of and scholarship opportunities. The competition ran consecutively and successfully for five years until it was replaced by Hackathon Xtreme in 2019.",
            "The Hackathon was divided into two phases, with the first phase filtering the applicants' initial submissions by a renowned judge panel, and the second phase at TECHNO, where finalists were encouraged to present their ideas and breakthroughs, along with their creativity and applications, followed by an in-depth Question and Answer session, allowing them to develop presentation, management, and critical thinking skills, which was lead to provide young competent engineers to the industry, as to the primary vision of the chapter."
        ],
        "filter":"filter-hackathon"
    },

    {
        "_id":2,
        "images":[
            "/assets/img/projects/hackathon-xtreme/1.jpg",
            "/assets/img/projects/hackathon-xtreme/2.jpg",
            "/assets/img/projects/hackathon-xtreme/3.jpg",
            "/assets/img/projects/hackathon-xtreme/4.jpg",
            "/assets/img/projects/hackathon-xtreme/5.jpg",
            "/assets/img/projects/hackathon-xtreme/6.jpg",
            "/assets/img/projects/hackathon-xtreme/7.png",
            "/assets/img/projects/hackathon-xtreme/8.jpg",
            "/assets/img/projects/hackathon-xtreme/9.jpg",
            "/assets/img/projects/hackathon-xtreme/10.jpg"
        ],
        "category": "past",
        "name": "Hackathon Xtreme",
        "brief": "Techno Hackathon Xtreme  was a contemporary initiative done by the IESL Student Chapter of the University of Moratuwa in partnership with the IESL and IESL YMS at BMICH premises with over 16 teams representing 8 leading, recognized state universities.  This was a coding competition in which the competitors could use a programming language of their preference.",
        "description": [
            "The Institute of Engineers Sri Lanka (IESL) is the leading professional body for Sri Lankan engineers. The IESL holds many events to uplift Sri Lankan engineering technology and inspires young enthusiasts in the engineering field.",
            "Techno Sri Lanka is the National Engineering and Technology exhibition and the annual flagship fair of the IESL. This exhibition consists of many revolutionary exhibits and inventions. Concur with the Techno exhibition, “ Techno Hackathon Xtreme 2019” was successfully conducted by the IESL Student Chapter of University of Moratuwa. This was a coding competition in which the competitors could use a programming language of their preference. The competition was open to all undergraduates from government and non-government universities.",
            "Techno Hackathon Xtreme was held on 12th October 2019 at BMICH premises. Although there were a significant number of applicants, the organizing committee had to choose the best 50 competitors to participate in the event in which a team consisted of 2-3 members. This was a level-based competition in which the final score was to be the total earned from each level. Also, the spectators got an opportunity to give their vote on social media to select the most popular team.",
            "After an extremely competitive Hackathon, the winners were finally announced. \"Team Cyborgs\" of the University of Jayewardenepura became the champions, while \"Team Seekers\" of the University of Moratuwa and \"Eye Coders\" of the University of Peradeniya won the second and third places, respectively. All the winners were awarded with grand monetary prizes.",
            "Hackathon Xtreme was successfully concluded along with \"Techno\" which was a contemporary initiative done by the IESL Student Chapter of the University of Moratuwa in partnership with the IESL and IESL YMS."
        ],
        "filter":"filter-hackathon"
    },

    {
        "_id":3,
        "images":[
            "/assets/img/projects/evotech/1.png",
            "/assets/img/projects/evotech/2.png",
            "/assets/img/projects/evotech/3.jpg",
            "/assets/img/projects/evotech/4.jpg",
            "/assets/img/projects/evotech/5.jpg",
            "/assets/img/projects/evotech/6.jpg",
            "/assets/img/projects/evotech/7.jpg",
            "/assets/img/projects/evotech/8.jpg"
        ],
        "category":"past",
        "name":"Evotech",
        "brief":"EVOTECH, the technical article writing competition is a novel initiative undertaken by the IESL Student Chapter of University of Moratuwa as an approach to escalate today’s sciences into tomorrow’s technologies.",
        "description":[
            "The world is getting smarter and faster day by day with the emergence of newer technologies. EVOTECH, the technical article writing competition is a novel initiative undertaken by the IESL Student Chapter of University of Moratuwa as an approach to escalate today’s sciences into tomorrow’s technologies while providing the opportunity for the undergraduates all over the island to grow personally as well as professionally.",
            "Technical writing is one of the many ways that is used to simplify the complexity of technology with the support of words. In an era that mankind no longer uses but lives the technology, the IESL student chapter of University of Moratuwa organized EVOTECH, the inter-university technical article competition further intending to create an opportunity to advertise the young and peer generations in seeking novel technologies and approaching real-life problems with innovative mindsets.",
            "Expecting the best impact five categories were provided for the participants to choose from which will cover the most ground of worldwide emerging technologies.Those categories were Emerging technological advancements in the field of civil engineering, Improvements and innovations in biomedical context, Nanotechnology and chemical advancements for a dominant future, Renewable energy and Robotics for space exploration.",
            "Among 150+ valid submissions, the best three articles and the Most Popular Article, for each category were chosen at the end of the competition and were rewarded with cash prizes. To cater for the best outcome, EVOTECH was opened to all Sri Lankan state university undergraduates to take part.",
            "Followed by the remarkable virtual session EngiQs, the Awarding Ceremony of Evotech was held on the 29th of August 2021, from 7 PM onwards with the honourable presence of Eng. Damith Dissanayake, Chairman of IESL-YMS. The session remarked its gigantic successful ending accompanied with a speech of a contestant who participated in Evotech and she emphasized that the competition was an extremely delightful experience for her to improve capacities and extended her heartfelt gratitude to the chapter for organizing such a prolific event for the young undergraduates to showcase their unique capabilities."
        ],
        "filter":"filter-evotech"
    },

    {
        "_id":4,
        "images":[
            "/assets/img/projects/engiqs/1.jpg",
            "/assets/img/projects/engiqs/2.jpg",
            "/assets/img/projects/engiqs/3.jpg",
            "/assets/img/projects/engiqs/4.png",
            "/assets/img/projects/engiqs/5.png"
        ],
        "category":"past",
        "name":"EngiQs",
        "brief":"EngiQs is a platform built for all engineering students of University of Moratuwa to get a brief idea about the university and the engineering profession and it was born in order to create an opportunity for undergraduates to have a precise knowledge of what they should do, and how to be the best in the field of engineering.",
        "description":[
            "While epitomizing another remarkable milestone to the 10-years excellency of the IESL Student Chapter of University of Moratuwa, the newfangled manoeuvre EngiQs accompanied by the Awarding Ceremony of Evotech were held successfully on 29th of August 2021, virtually through zoom platform with the enthusiastic participation of 200+ participants throughout the event. The key motive of the session was to make the young undergraduates aware of various opportunities available in the field of engineering, to focus on the questions that the university students have regarding the engineering field and to find solutions to them to the utmost degree.",
            "The gathered audience was warmly welcomed by Mr. Rashan Madhuranga, the Chairman of the IESL Student Chapter of University of Moratuwa. Then a resplendent introductory video was presented to the virtual audience in order to embellish the awareness of the university and the chapter. Followed by this invigorating video clip, the session was handed over to the keynote speaker of the event. Dr. Pujitha Silva, a senior lecturer in University of Moratuwa, Department of Biomedical Engineering, PhD. Mechanical Engineering, B.Eng. Medical Engineering dignified this prestigious occasion as the guest speaker. Through this innovative concept, he was able to convince these passionate undergraduates about various aspects that are currently executing in the engineering field. His thoughts and graceful take on this occasion made the event more informative and the participants were certainly thrilled and excited to hear his enlightening speech.",
            "Afterwards, the event was opened for a Q&A session which further granted the virtual audience to clarify their doubts and discuss their field related issues with the resource person. Then the event was followed by another interactive quiz session with a fun element to it, with the participants and their sprightly contribution escorted the event to a success."
        ],
        "filter":"filter-engiqs"
    },

    {
        "_id":5,
        "images":[
            "/assets/img/projects/talk-to-school/1.png",
            "/assets/img/projects/talk-to-school/2.jfif",
            "/assets/img/projects/talk-to-school/3.png",
            "/assets/img/projects/talk-to-school/4.png",
            "/assets/img/projects/talk-to-school/5.png"
        ],
        "category":"past",
        "name":"Talk to School",
        "brief": "Talk to School is a signature project done in association with the IESL-Young Members Section where we extend helping hands to a selected school in motivating them to choose the right career path to a brighter future.",
        "description": [
            "The 'Talk to school' program was conducted by the Young Members Section (YMS) Committee of the Institute of Engineers, Sri Lanka (IESL) in collaboration with the IESL Student Chapter, University of Moratuwa (UoM), was held at Taxila Central College, Horana on 29th July 2019. Engineers return to their alma mater to share their experiences, educate students about the value of engineering, and guide and inspire students to become successful engineers in the future. The goal of this program is to develop a better future generation, so that includes key speeches that will help them achieve their goals.",
            "The event started at 9 a.m. and the school main hall had been pleasantly prepared for the event. Grade 12 Physical Science stream students of Taxila College participated in the program. Mrs. K. M. P. K. Jayathilake, the Principal, Teachers of the School, honorable guests from the IESL YMS, the President, Secretary, and Committee Members of the IESL Student Chapter of the University of Moratuwa were present on this occasion. The sincere speech was delivered by Mrs. K. M. P. K. Jayathilake, the Principal, and welcomed all the officials to the event, and the event was proceeded according to the agenda.",
            "As the chief guest, Eng. Arjuna Manamperi, who was then the Vice President of IESL, disclosed new thinking to the young students in his speech on 'How to prepare as Engineers with a Futuristic Vision'. In his very interactive session, students were fortunate to share their future ambitions and have advice from such a well-experienced professional. As a highlight, a female student who was ambitious of being an Air Traffic Controller was able to be informed about the way of her future preparations. All the future goals of the students added a new flavor to the program and assured of a very promising future for the country.",
            "Thereafter, a gaming session was conducted by the members of the IESL Student Chapter of the University of Moratuwa, showcasing that Engineers are analytical thinkers. All the students enjoyed the time a great deal and gifts which were prepared by IESL YMS were offered to the winners. An appealing music session was presented by three undergraduates from the University of Moratuwa and all the participants were fascinated by their performance.",
            "The third speaker, Eng. Navodana Kankanamge, who was an IESL Council Member back then, enlightened the students on the role of an Engineer with his own experience of 10 years at the Ceylon Electricity Board. Afterward, Mr. Kithmal Samarasekara, who graduated from the University of Moratuwa shared his university experience with fellow youngsters. This was quite a change of phase in the program, because of his interactive speech and students were interested in knowing about university life.",
            "Students were allowed to clarify the questions they have related to their future education and career path. The leaflet produced by the IESL YMS was also explained to the students. The students were encouraged to contact IESL or the resource persons on any issues they needed guidance on.",
            "Delivering the closing comments, the Sectional Head of Physical Science Section of Taxila Central College, extended his sincere appreciation to IESL for launching this awareness program. He further agreed that this kind of program that gives a broader view of the profession is equally important for the students. Accordingly, at one hour past noon, a successful event was brought to its closure."
        ],
        "filter":"filter-talk-school"
    },

    {
        "_id":6,
        "images":[
            "/assets/img/projects/paving-paths/1.png",
            "/assets/img/projects/paving-paths/2.PNG",
            "/assets/img/projects/paving-paths/3.png",
            "/assets/img/projects/paving-paths/4.png"
        ],
        "category":"past",
        "name":"Paving Paths",
        "brief": "Paving Paths is undertaken by the IESL - Student Chapter of University of Moratuwa to direct the engineering freshers, to identify their dream career paths under the guidance of experts in the field.",
        "description": [
            "\"Paving Paths\" organized by the IESL Student Chapter of University of Moratuwa, was an attempt to bring the connection between the Undergraduates and the industry experts to a virtual platform broadening the reach of the audience despite the hardships faced due to Covid19 Pandemic. \"Paving Paths 2020\" marked the first ever virtual webinar organized by the student chapter.",
            "Eng. Arjuna Manamperi, a well known engineer in the industry was the guest speaker of the \"Paving Paths\" in the year 2020. He has shared his 25+ years of experience and insights he gained through his experience with the participants. It was extremely beneficial for all the participants who joined for the session. Eng. Manamperi has enlightened the audience about many important aspects for the aspiring youth engineering undergraduates such as the importance of accreditation and accreditation procedure of Universities, the process of becoming a Chartered Engineer, about the engineering council, and many more. The event marked a great success with 150+ participants. All the participants eagerly gained the best out of the opportunity by enthusiastic engagement during the Q&A session.",
            "Paving Paths can be called as one of its kind as the opportunities for engineering undergraduates to get exposure to this knowledge are very limited. As a proud student organization with a history of 10 years, serving the undergraduate community, the IESL Student Chapter of University of Moratuwa will continue this endeavor to enlighten many more generations of youth undergraduates to come."
        ],
        "filter":"filter-paving-path"
    },

    {
        "_id":7,
        "images":[
            "/assets/img/projects/agm/1.jpg",
            "/assets/img/projects/agm/2.jpg",
            "/assets/img/projects/agm/3.jpg",
            "/assets/img/projects/agm/4.jpg",
            "/assets/img/projects/agm/5.PNG",
            "/assets/img/projects/agm/6.PNG",
            "/assets/img/projects/agm/7.PNG",
            "/assets/img/projects/agm/8.jpg",
            "/assets/img/projects/agm/9.jpg",
            "/assets/img/projects/agm/10.jpg",
            "/assets/img/projects/agm/11.jpg",
            "/assets/img/projects/agm/12.jpg",
            "/assets/img/projects/agm/13.jpg",
            "/assets/img/projects/agm/14.jpg",
            "/assets/img/projects/agm/15.jpg",
            "/assets/img/projects/agm/16.jpg",
            "/assets/img/projects/agm/17.jpg",
            "/assets/img/projects/agm/18.jpg",
            "/assets/img/projects/agm/19.jpg",
            "/assets/img/projects/agm/20.jpg",
            "/assets/img/projects/agm/21.jpg",
            "/assets/img/projects/agm/22.jpg",
            "/assets/img/projects/agm/23.jpg"
        ],
        "category":"past",
        "name": "Annual General Meeting",
        "brief": "This marks the beginning of the year and provides a kickstart to the chapter by appointing the new executive committee and board of officials for the year. All the members gather annually for this occasion and discuss key issues and arrive at decisions regarding the short-term and long-term strategies of the chapter.",
        "description": [
            "The annual general meeting of IESL Student Chapter of University of Moratuwa is one of the most anticipated projects that marks the beginning of a new era for the chapter and it rejuvenates the chapter by appointing the new executive committee and board of officials for the upcoming year. Every year, all the beloved members assemble for this occasion and discuss the key issues and arrive at decisions regarding the short and long term strategies of the chapter. The project enhances the interactions and fellowship between the members while signifying a pristine incipiency to the chapter.",
            "When reminiscing annual general meetings held in past few years, the annual general meeting of 2019 took place on 4th of April 2019 in the Civil auditorium of the University of Moratuwa and the event was graced with the honourable participation of the elected president of the IESL, Prof. T.M. Palewatte while the annual general meeting of 2020 was successfully held on 9th January of 2020 at 10.30 am in the Electrical department auditorium of the university. Eng. Arjun Manamperi adored this moment by delivering a speech on \"Legalising engineering profession and must have attitudes of a young engineer\"  and then a new executive committee for the year 2020 was elected.",
            "Accepting the COVID-19 challenge promptly when everything was happening virtually, the annual general meeting of 2021 year was held on the 28th of March 2021 with great success via the zoom platform. The occasion was honoured by the presence of the president-Elect of IESL Eng. Arjuna Manamperi as the chief guest, Senior Treasurer, and the Senior Advisor of the chapter senior Prof. Jagath Manatunge, Immediate past Chairman of IESL – YMS and Chairman of IESL- JIY Eng. Navodana Kankanamge, Chairman of IESL-YMS Eng. Damith Dissanayake, Immediate past Secretary of IESL – YMS Dr. Dulini Mudunkotuwa, and Secretary of IESL-YMS Eng. Randith Dinesh.",
            "It was no secret that the arrival of the chief guest, President-Elect of IESL Eng Arjuna Manamperi, made the AGM even more special this time. Eng. Arjuna Manamperi brought together a vast knowledge on IESL Accreditation, IESL recognition in state universities, Washington Accords, and Engineering Ethics throughout his speech. This undoubtedly made the AGM an oasis of knowledge for the participants who have joined across the country. The session was also enlightened by the speeches by the Senior Treasurer, and the Senior Advisor of the chapter, senior Prof. Jagath Manatunge and Chairman of IESL-YMS Eng. Damith Dissanayake.",
            "Thereafter, following the official proceedings of the AGM the new members were elected as the executive committee of the IESL Student Chapter of University of Moratuwa for the reign of 2020/21 and the session was concluded after the vote of thanks by the newly appointed Chief Operating Officer Mr. Amila Premakumara while heralding the chapter’s bequest at its utmost level."
        ],
        "filter":"filter-agm"
    },

    {
        "_id":8,
        "images":[
            "/assets/img/projects/cdp/1.png",
            "/assets/img/projects/cdp/2.png",
            "/assets/img/projects/cdp/3.png",
            "/assets/img/projects/cdp/4.png",
            "/assets/img/projects/cdp/5.png"
        ],
        "category":"past",
        "name": "Continuing Professional development projects",
        "brief": "A series of online courses related to ten engineering fields which will provide extra qualifications for our undergraduate students intend to conduct with the help of Institute of Engineers, Sri Lanka by IESL Student Chapter of the University of Moratuwa.",
        "description": [
            "When the covid 19 pandemic hit the world, no one was ready for that kind of a challenge. However, this era is highly evolved with technology, the whole world could adapt to the changes and be able to find solutions for lots of questions with the help of new technology.",
            "One of the areas that was completely changed was education. Since students from pre-school level to university level couldn't gather at a school or a relevant educational institution, the only option was distance learning or online learning. Even Though for some people online learning was overwhelming, the majority in the world was able to continue their education without any interruptions.  Also, for some students, especially in higher education levels, online learning was very effective. And the IESL student chapter of University of Moratuwa was able to notice the advantages of this new trend.",
            "Since all of the students in the university are at home and continuing their education online, most of the students have some extra time after university hours. So it was suggested that to organize a series of online courses for the students with the help of the Institute of Engineers, Sri Lanka to improve the skills of the students. After some discussions within the chapter, it was decided to let the student choose what they want to learn by themself. So the students in ten different fields of engineering will have a custom made course which will provide them some extra qualifications for their future. After some surveys were done within the departments, a well-planned course outline was created for every course by the department coordinators of the IESL Student Chapter. And now the final proposals are being processed by the IESL.  Since these courses will be conducted by experts in the relevant fields, students will have a once in a lifetime opportunity to gain knowledge and get to know about what they will be really doing in their relevant jobs. Also, a certificate will be given to the students who will successfully complete the course by the IESL."
        ],
        "filter":"filter-cdp"
    },

    {
        "_id":9,
        "images":[
            "/assets/img/projects/scholastic/1.jpg",
            "/assets/img/projects/scholastic/2.jpg",
            "/assets/img/projects/scholastic/3.jpg",
            "/assets/img/projects/scholastic/4.jpg"
        ],
        "category":"past",
        "name": "Scholastic",
        "brief": "Scholastic, Mathematics Seminar Series for Ordinary Level students was successfully launched by IESL Student Chapter of the University of Moratuwa in partnership with IESL and IESL YMS in the year 2019 at the Beralihela Kande Vidyalaya, Tissamaharama.",
        "description": [
            "The IESL Student Chapter of the University of Moratuwa can be cited as the most outstanding IESL Student Chapter in partnership with IESL and IESL YMS, newly introduced an initiative to step up toward the community service avenue in the year 2019. That initiative was a Two-Day Mathematics seminar for Ordinary Level students and was named \"Scholastic\". The  Scholastic event was shaped with the intent to be friendly and motivate students, uplift their mathematical knowledge, and also to go beyond formal education and let the \"Miracle of Sir Einstein\" happen.",
            "The core part of the event, the tutoring crew was assembled with experienced and enthusiastic undergraduates of the University of Moratuwa. The commencement of “Scholastic” was marked on the 18th of October 2019, at the Beralihela Kande Vidyalaya, Tissamaharama, which is located in the countryside. Throughout the seminar, students of Beralihela Kande Vidyalaya could learn many things than just mathematics.",
            "With the invaluable support and guidance received from the Chairman of IESL YMS, the Principal, and the staff of Beralihela Kande Vidyalaya, the Scholastic seminar has successfully marked its conclusion on 19th of October 2019. The feedback received from the attendees was averring about the success of the seminar. Literary, Scholastic can be connoted as one major benefaction done for the next generation."
        ],
        "filter":"filter-scholastic"
    },

    {
        "_id":10,
        "images":[
            "/assets/img/projects/symposiarch/1.jpg",
            "/assets/img/projects/symposiarch/2.jpg",
            "/assets/img/projects/symposiarch/3.jpg",
            "/assets/img/projects/symposiarch/4.jpg",
            "/assets/img/projects/symposiarch/5.jpg",
            "/assets/img/projects/symposiarch/6.jpg",
            "/assets/img/projects/symposiarch/7.jpg",
            "/assets/img/projects/symposiarch/8.jpg",
            "/assets/img/projects/symposiarch/9.jpg",
            "/assets/img/projects/symposiarch/10.jpg"
        ],
        "category":"past",
        "name": "Symposiarch",
        "brief": "This is a unique initiative carried out by IESL in collaboration with YMS. Under the project, a potent project proposal prepared by the students at University of Moratuwa was selected and a team of professionals guided them to make the project a reality.",
        "description": [
            "\"SYMPOSIARCH\" is a novel initiative which was undertaken by IESL -YMS with the theme of \"Interact with Youth\". SYMPOSIARCH was held on the 16th of December 2019 at the CSE seminar room. The members of IESL Student Chapter of University of Moratuwa were allowed to have a friendly discussion and a deliberation on ongoing and upcoming projects to be conducted by the chapter with the executives of IESL-YMS.",
            "As the first initiative, with the honourable presence of the chairman IESL-YMS for the year 2019/20, Eng.Navodana Kankanamge, We the IESL student chapter of University of Moratuwa was able to conduct a successful evening whilst enhancing ourselves. Further, all the department coordinators presented their projects to conduct for respective departments of engineering faculty of University of Moratuwa and all the project proposals were analyzed by Eng.Navodana Kankanamge. It was a precious moment that all the project proposals, ongoing and upcoming projects of the chapter were admired by the Eng. Navodana Kankanamge.",
            "The media coverage of the evening was undertaken by MoraWings which is powered by our chapter. The opportunity of interacting with executives in the engineering industry was a magnificent moment for every undergraduate who participated in the SYMPOSIARCH program."
        ],
        "filter":"filter-symposiarch"
    }
]